// Напишите программу, которая будет выдавать название дня недели по заданному номеру
//	3 -> Среда 
// 5 -> Пятница

Console.Write ("Введите цифру:");
int dayNum = int.Parse(Console.
if (dayNum < 1 && dayNum > 7)